In [1]:
%LOAD sqlite3 db=../databases/imdb.db timeout=2 shared_cache=true

In [6]:
ATTACH "../databases/covid19.db" AS covid19;

In [23]:
ATTACH "../databases/nba.db" AS nba;

In [24]:
ATTACH "../databases/twElection2020.db" AS twElection2020;

In [3]:
SELECT 2.718 AS e,
       ROUND(2.718) AS round_e_0,    -- round to 0 digit
       ROUND(2.718, 1) AS round_e_1, -- round to 1 digit
       ROUND(2.718, 2) AS round_e_2; -- round to 2 digits

+-------+-----------+-----------+-----------+
| e     | round_e_0 | round_e_1 | round_e_2 |
+-------+-----------+-----------+-----------+
| 2.718 | 3.0       | 2.7       | 2.72      |
+-------+-----------+-----------+-----------+
1 row in set (0.00 sec)

In [4]:
SELECT 'Tony Stark' AS ironman,
       SUBSTR('Tony Stark', 1, 4) AS first_name, -- sub-string from the 1st character for length of 4
       SUBSTR('Tony Stark', 6, 5) AS last_name;  -- sub-string from the 6th character for length of 5

+------------+------------+-----------+
| ironman    | first_name | last_name |
+------------+------------+-----------+
| Tony Stark | Tony       | Stark     |
+------------+------------+-----------+
1 row in set (0.00 sec)

In [6]:
SELECT ROUND(2.718) AS round_e_0,
       DATE() AS todays_date;

+-----------+-------------+
| round_e_0 | todays_date |
+-----------+-------------+
| 3.0       | 2024-04-16  |
+-----------+-------------+
1 row in set (0.00 sec)

In [5]:
SELECT 'Boston' AS city,
       UPPER(SUBSTR('Boston', 1, 3)) AS composite_function;

+--------+--------------------+
| city   | composite_function |
+--------+--------------------+
| Boston | BOS                |
+--------+--------------------+
1 row in set (0.00 sec)

In [7]:
SELECT rating,
       ROUND(rating) AS round_rating
  FROM movies
 LIMIT 5;

+--------+--------------+
| rating | round_rating |
+--------+--------------+
| 9.3    | 9.0          |
+--------+--------------+
| 9.2    | 9.0          |
+--------+--------------+
| 9      | 9.0          |
+--------+--------------+
| 9      | 9.0          |
+--------+--------------+
| 9      | 9.0          |
+--------+--------------+
5 rows in set (0.00 sec)

In [8]:
SELECT title,
       SUBSTR(title, 1, 3) AS substr_title
  FROM movies
 LIMIT 4;

+--------------------------+--------------+
| title                    | substr_title |
+--------------------------+--------------+
| The Shawshank Redemption | The          |
+--------------------------+--------------+
| The Godfather            | The          |
+--------------------------+--------------+
| The Dark Knight          | The          |
+--------------------------+--------------+
| The Godfather Part II    | The          |
+--------------------------+--------------+
4 rows in set (0.00 sec)

In [10]:
SELECT AVG(rating) AS avg_rating
  FROM movies;

+------------+
| avg_rating |
+------------+
| 8.3072     |
+------------+
1 row in set (0.00 sec)

In [12]:
SELECT TYPEOF(release_year) AS typeof_release_year,
       TYPEOF(rating) AS typeof_rating,
       TYPEOF(title) AS typeof_title
  FROM movies
 LIMIT 1;

+---------------------+---------------+--------------+
| typeof_release_year | typeof_rating | typeof_title |
+---------------------+---------------+--------------+
| integer             | real          | text         |
+---------------------+---------------+--------------+
1 row in set (0.00 sec)

In [13]:
SELECT IFNULL(NULL, NULL) AS null_value,
       IFNULL(NULL, 'Null replaced by text') AS text_value;

+------------+-----------------------+
| null_value | text_value            |
+------------+-----------------------+
| NULL       | Null replaced by text |
+------------+-----------------------+
1 row in set (0.00 sec)

In [8]:
SELECT Province_State,
       IFNULL(Province_State, 'No province data') AS province_or_text_value,
       Admin2,
       IFNULL(Admin2, 'No county data') AS county_or_text_value
  FROM lookup_table
 LIMIT 5;

+----------------+------------------------+--------+----------------------+
| Province_State | province_or_text_value | Admin2 | county_or_text_value |
+----------------+------------------------+--------+----------------------+
| NULL           | No province data       | NULL   | No county data       |
+----------------+------------------------+--------+----------------------+
| NULL           | No province data       | NULL   | No county data       |
+----------------+------------------------+--------+----------------------+
| NULL           | No province data       | NULL   | No county data       |
+----------------+------------------------+--------+----------------------+
| NULL           | No province data       | NULL   | No county data       |
+----------------+------------------------+--------+----------------------+
| American Samoa | American Samoa         | NULL   | No county data       |
+----------------+------------------------+--------+----------------------+
5 rows in set (0.00 sec)

In [9]:
SELECT COALESCE(NULL, NULL) AS null_value,
       COALESCE(NULL, 'Null replaced by text') AS text_value,
       COALESCE(NULL, NULL, 'Null replaced by text') AS text_value;

+------------+-----------------------+-----------------------+
| null_value | text_value            | text_value            |
+------------+-----------------------+-----------------------+
| NULL       | Null replaced by text | Null replaced by text |
+------------+-----------------------+-----------------------+
1 row in set (0.00 sec)

In [10]:

SELECT Province_State,
       Admin2,
       COALESCE(Province_State, Admin2) AS province_or_null,
       COALESCE(Province_State, Admin2, 'No province or county data') AS province_or_text_value
  FROM lookup_table
 LIMIT 5;

+----------------+--------+------------------+----------------------------+
| Province_State | Admin2 | province_or_null | province_or_text_value     |
+----------------+--------+------------------+----------------------------+
| NULL           | NULL   | NULL             | No province or county data |
+----------------+--------+------------------+----------------------------+
| NULL           | NULL   | NULL             | No province or county data |
+----------------+--------+------------------+----------------------------+
| NULL           | NULL   | NULL             | No province or county data |
+----------------+--------+------------------+----------------------------+
| NULL           | NULL   | NULL             | No province or county data |
+----------------+--------+------------------+----------------------------+
| American Samoa | NULL   | American Samoa   | American Samoa             |
+----------------+--------+------------------+----------------------------+
5 rows in set (0.00 sec)

In [11]:

SELECT runtime,
       ROUND(runtime/60.0) AS hours_0,    -- round to 0 digit
       ROUND(runtime/60.0, 1) AS hours_1, -- round to 1 digit
       ROUND(runtime/60.0, 2) AS hours_2  -- round to 2 digits
  FROM movies
 LIMIT 5;

+---------+---------+---------+---------+
| runtime | hours_0 | hours_1 | hours_2 |
+---------+---------+---------+---------+
| 142     | 2.0     | 2.4     | 2.37    |
+---------+---------+---------+---------+
| 175     | 3.0     | 2.9     | 2.92    |
+---------+---------+---------+---------+
| 152     | 3.0     | 2.5     | 2.53    |
+---------+---------+---------+---------+
| 202     | 3.0     | 3.4     | 3.37    |
+---------+---------+---------+---------+
| 96      | 2.0     | 1.6     | 1.6     |
+---------+---------+---------+---------+
5 rows in set (0.00 sec)

In [12]:
SELECT title,
       LENGTH(title) AS length_title
  FROM movies
 LIMIT 5;

+--------------------------+--------------+
| title                    | length_title |
+--------------------------+--------------+
| The Shawshank Redemption | 24           |
+--------------------------+--------------+
| The Godfather            | 13           |
+--------------------------+--------------+
| The Dark Knight          | 15           |
+--------------------------+--------------+
| The Godfather Part II    | 21           |
+--------------------------+--------------+
| 12 Angry Men             | 12           |
+--------------------------+--------------+
5 rows in set (0.00 sec)

In [13]:
SELECT title,
       SUBSTR(title, 1, 3) AS substr_title
  FROM movies
 LIMIT 4;

+--------------------------+--------------+
| title                    | substr_title |
+--------------------------+--------------+
| The Shawshank Redemption | The          |
+--------------------------+--------------+
| The Godfather            | The          |
+--------------------------+--------------+
| The Dark Knight          | The          |
+--------------------------+--------------+
| The Godfather Part II    | The          |
+--------------------------+--------------+
4 rows in set (0.00 sec)

In [14]:
SELECT title,
       LOWER(title) AS lower_title,
       UPPER(title) AS upper_title
  FROM movies
 LIMIT 5;

+--------------------------+--------------------------+--------------------------+
| title                    | lower_title              | upper_title              |
+--------------------------+--------------------------+--------------------------+
| The Shawshank Redemption | the shawshank redemption | THE SHAWSHANK REDEMPTION |
+--------------------------+--------------------------+--------------------------+
| The Godfather            | the godfather            | THE GODFATHER            |
+--------------------------+--------------------------+--------------------------+
| The Dark Knight          | the dark knight          | THE DARK KNIGHT          |
+--------------------------+--------------------------+--------------------------+
| The Godfather Part II    | the godfather part ii    | THE GODFATHER PART II    |
+--------------------------+--------------------------+--------------------------+
| 12 Angry Men             | 12 angry men             | 12 ANGRY MEN             |
+--------------------------+--------------------------+--------------------------+
5 rows in set (0.00 sec)

In [15]:
SELECT DATE('2022-12-31') AS date_20221231,
       TIME('23:59:59') AS time_235959,
       DATETIME('2022-12-31 23:59:59') AS datetime_20221231235959;

+---------------+-------------+-------------------------+
| date_20221231 | time_235959 | datetime_20221231235959 |
+---------------+-------------+-------------------------+
| 2022-12-31    | 23:59:59    | 2022-12-31 23:59:59     |
+---------------+-------------+-------------------------+
1 row in set (0.00 sec)

In [16]:
SELECT DATE('now') AS date_20221231,
       TIME('now') AS time_235959,
       DATETIME('now') AS datetime_20221231235959;

+---------------+-------------+-------------------------+
| date_20221231 | time_235959 | datetime_20221231235959 |
+---------------+-------------+-------------------------+
| 2024-04-16    | 02:06:23    | 2024-04-16 02:06:23     |
+---------------+-------------+-------------------------+
1 row in set (0.00 sec)

In [18]:
SELECT '2022-12-31 23:59:59' AS datetime_20221231235959,
       STRFTIME('%d', '2022-12-31 23:59:59') AS day_part,
       STRFTIME('%j', '2022-12-31 23:59:59') AS day_of_year,
       STRFTIME('%m', '2022-12-31 23:59:59') AS month_part,
       STRFTIME('%w', '2022-12-31 23:59:59') AS weekday,
       STRFTIME('%W', '2022-12-31 23:59:59') AS nth_week,
       STRFTIME('%Y', '2022-12-31 23:59:59') AS year_part,
       STRFTIME('%H:%M:%S', '2022-12-31 23:59:59') AS time_part;

+-------------------------+----------+-------------+------------+---------+----------+-----------+-----------+
| datetime_20221231235959 | day_part | day_of_year | month_part | weekday | nth_week | year_part | time_part |
+-------------------------+----------+-------------+------------+---------+----------+-----------+-----------+
| 2022-12-31 23:59:59     | 31       | 365         | 12         | 6       | 52       | 2022      | 23:59:59  |
+-------------------------+----------+-------------+------------+---------+----------+-----------+-----------+
1 row in set (0.00 sec)

In [19]:
SELECT AVG(rating) AS avg_rating,
       MIN(rating) AS min_rating,
       MAX(rating) AS max_rating
  FROM movies;

+------------+------------+------------+
| avg_rating | min_rating | max_rating |
+------------+------------+------------+
| 8.3072     | 8.0        | 9.3        |
+------------+------------+------------+
1 row in set (0.00 sec)

In [20]:

SELECT COUNT(*) AS nrows_table,    -- table總列數
       COUNT(Province_State) AS non_null_province,  -- 該欄位非NULL的總數
       COUNT(Admin2) AS non_null_county
  FROM lookup_table;

+-------------+-------------------+-----------------+
| nrows_table | non_null_province | non_null_county |
+-------------+-------------------+-----------------+
| 4317        | 4118              | 3344            |
+-------------+-------------------+-----------------+
1 row in set (0.00 sec)

In [21]:
SELECT COUNT(*) AS nrows_table,
       COUNT(Combined_Key) AS non_null_combined_key
  FROM lookup_table;

+-------------+-----------------------+
| nrows_table | non_null_combined_key |
+-------------+-----------------------+
| 4317        | 4317                  |
+-------------+-----------------------+
1 row in set (0.00 sec)

# Exercise

In [26]:
SELECT heightMeters, weightKilograms,
       ROUND( weightKilograms / (heightMeters * heightMeters) , 2) AS bmi
  FROM nba.players
  LIMIT 5;

+--------------+-----------------+-------+
| heightMeters | weightKilograms | bmi   |
+--------------+-----------------+-------+
| 2.06         | 113.4           | 26.72 |
+--------------+-----------------+-------+
| 2.01         | 108             | 26.73 |
+--------------+-----------------+-------+
| 2.03         | 106.6           | 25.87 |
+--------------+-----------------+-------+
| 2.08         | 120.2           | 27.78 |
+--------------+-----------------+-------+
| 1.98         | 97.5            | 24.87 |
+--------------+-----------------+-------+
5 rows in set (0.00 sec)

In [27]:
SELECT assists, turnovers,
       assists *1.0 / turnovers AS assist_turnover_ratio
  FROM nba.career_summaries
 LIMIT 5;

+---------+-----------+-----------------------+
| assists | turnovers | assist_turnover_ratio |
+---------+-----------+-----------------------+
| 10045   | 4788      | 2.09795321637427      |
+---------+-----------+-----------------------+
| 3422    | 3052      | 1.12123197903014      |
+---------+-----------+-----------------------+
| 733     | 809       | 0.906056860321384     |
+---------+-----------+-----------------------+
| 1676    | 3302      | 0.507571168988492     |
+---------+-----------+-----------------------+
| 5128    | 2231      | 2.29852084267145      |
+---------+-----------+-----------------------+
5 rows in set (0.00 sec)

In [29]:
SELECT assists, turnovers,
       CAST( assists AS REAL) / turnovers AS assist_turnover_ratio
  FROM nba.career_summaries
 LIMIT 5;

+---------+-----------+-----------------------+
| assists | turnovers | assist_turnover_ratio |
+---------+-----------+-----------------------+
| 10045   | 4788      | 2.09795321637427      |
+---------+-----------+-----------------------+
| 3422    | 3052      | 1.12123197903014      |
+---------+-----------+-----------------------+
| 733     | 809       | 0.906056860321384     |
+---------+-----------+-----------------------+
| 1676    | 3302      | 0.507571168988492     |
+---------+-----------+-----------------------+
| 5128    | 2231      | 2.29852084267145      |
+---------+-----------+-----------------------+
5 rows in set (0.00 sec)

In [37]:
SELECT DISTINCT STRFTIME('%Y', Date) || '-' || STRFTIME('%m', Date) AS distinct_year_month
  FROM covid19.time_series;

+---------------------+
| distinct_year_month |
+---------------------+
| 2020-01             |
+---------------------+
| 2020-02             |
+---------------------+
| 2020-03             |
+---------------------+
| 2020-04             |
+---------------------+
| 2020-05             |
+---------------------+
| 2020-06             |
+---------------------+
| 2020-07             |
+---------------------+
| 2020-08             |
+---------------------+
| 2020-09             |
+---------------------+
| 2020-10             |
+---------------------+
| 2020-11             |
+---------------------+
| 2020-12             |
+---------------------+
| 2021-01             |
+---------------------+
| 2021-02             |
+---------------------+
| 2021-03             |
+---------------------+
| 2021-04             |
+---------------------+
| 2021-05             |
+---------------------+
| 2021-06             |
+---------------------+
| 2021-07             |
+---------------------+
| 2021-08             |
+---------------------+
| 2021-09             |
+---------------------+
| 2021-10             |
+---------------------+
| 2021-11             |
+---------------------+
| 2021-12             |
+---------------------+
| 2022-01             |
+---------------------+
| 2022-02             |
+---------------------+
| 2022-03             |
+---------------------+
| 2022-04             |
+---------------------+
| 2022-05             |
+---------------------+
29 rows in set (0.05 sec)

In [39]:
SELECT *
  FROM twElection2020.presidential
 LIMIT 5;

+-----------------+--------+--------------+-------+
| admin_region_id | office | candidate_id | votes |
+-----------------+--------+--------------+-------+
| 996             | 1      | 1            | 37    |
+-----------------+--------+--------------+-------+
| 996             | 2      | 1            | 31    |
+-----------------+--------+--------------+-------+
| 983             | 3      | 1            | 19    |
+-----------------+--------+--------------+-------+
| 983             | 4      | 1            | 29    |
+-----------------+--------+--------------+-------+
| 998             | 5      | 1            | 25    |
+-----------------+--------+--------------+-------+
5 rows in set (0.00 sec)

In [44]:
SELECT SUM(votes) AS total_presidential_votes
  FROM twElection2020.presidential;

+--------------------------+
| total_presidential_votes |
+--------------------------+
| 14300940                 |
+--------------------------+
1 row in set (0.00 sec)

In [45]:
SELECT *
  FROM covid19.daily_report
 LIMIT 5;

+--------------+---------------------+-----------+--------+
| Combined_Key | Last_Update         | Confirmed | Deaths |
+--------------+---------------------+-----------+--------+
| Afghanistan  | 2022-06-01 04:20:55 | 180347    | 7705   |
+--------------+---------------------+-----------+--------+
| Albania      | 2022-06-01 04:20:55 | 276101    | 3497   |
+--------------+---------------------+-----------+--------+
| Algeria      | 2022-06-01 04:20:55 | 265884    | 6875   |
+--------------+---------------------+-----------+--------+
| Andorra      | 2022-06-01 04:20:55 | 42894     | 153    |
+--------------+---------------------+-----------+--------+
| Angola       | 2022-06-01 04:20:55 | 99761     | 1900   |
+--------------+---------------------+-----------+--------+
5 rows in set (0.00 sec)

In [48]:
SELECT SUM(Confirmed) AS total_confirmed,
       SUM(Deaths) AS total_deaths
  FROM covid19.daily_report;

+-----------------+--------------+
| total_confirmed | total_deaths |
+-----------------+--------------+
| 529625234       | 6292512      |
+-----------------+--------------+
1 row in set (0.00 sec)